# -*- coding: utf-8 -*-
# Калкулатор Задача 1 (1 / 4)
# Напишете функција која ќе ги содржи функционалностите на едноставен аритметички калкулатор.
# Интеракција со калкулаторот треба да се врши преку читање на параметри од стандардниот влез со наредбата input(),
#  т.е. се внесуваат двата операнди и операторот во командна линија. По процесирање на барањето од страна на функцијата
# се обработува и печати се печати резултатот на екран, заокружен со наредбата round(rezultat, 5) на 5 децимали.
#  Командите кои ги испраќаме на калкулаторот се читаат од стандарден влез и треба да го имаат следниот формат:
#
# операнд1
#
# оператор
#
# операнд2
#
# Доколку настанала грешка при внес соодветно да се извести корисникот. Калкулаторот треба да ги подржува следните операции:
#
# Собирање (+) Одземање (-) Множење (*) Целобројно делење (//) Делење (/) Модуло (остаток) (%) Степенување (**)
__operators = ('+', '-', '/', '//', '*', '**', '%')


def calculator():
    x = float(input())
    operator = input()
    y = float(input())



    rezultat = 0
    if operator == '+':
        rezultat = x + y
    elif operator == '-':
        rezultat = x - y
    elif operator == '/':
        rezultat = x / y
    elif operator == '//':
        rezultat = x // y
    elif operator == '*':
        rezultat = x * y
    elif operator == '**':
        rezultat = x ** y
    elif operator == '%':
        rezultat = x % y

    print(round(rezultat, 5))
    return rezultat


if __name__ == "__main__":
    a = calculator()
